package by.javaguru;

public class Main {
    public static void main(String[] args) {
    System.out.print("Hello world... How are you2");
    }

    //============================== [ Целочисленные типы ] ===========================

    // [ Тип данных byte ] - { может хранить в себе числа от -128 до 127 } расходует 1-байт памяти
    byte b = 1;

    // [ Тип данных short ] - { может хранить в себе числа от -2**15 до 2**15-1 } расходует 2-байт памяти
    short s = 9;

    // [ Тип данных int ] - { может хранить в себе числа от -2**31 до 2**31-1 } расходует 4-байт памяти
    int i = 1000;

    // [ Тип данных long ] - { может хранить в себе числа от -2**63 до 2**63-1 } расходует 8-байт памяти
    long l = 1230123413;

    //============================== [ Дробные числа ] ===========================

    // [ Тип данных float ] - { может хранить в себе числа от 1.4*10-**45 до 1.4*10**38 } расходует 4-байт памяти
    float f = 10.55f;

    // [ Тип данных double ] - { может хранить в себе числа от 4.9*10**-324 до 1.8*10**309 } расходует 8-байт памяти
    double d = 10.55;

    //============================== [ Символьный тип ] ===========================

    // [ Тип данных char ] - { может хранить в себе 's' } расходует 2-байт памяти
    char c = 's';

    //============================== [ Логический тип ] ===========================

    // [ Тип данных boolean ] - { может хранить в себе false или true } по умолчанию всегда false
    boolean isActive = true;

}